---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.ShowRoomBoundingElements
source: html/a04bd2e5-a70f-3176-74aa-7c3f6c1e0dbc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.ShowRoomBoundingElements Property

[Room] Bounding elements are highlighted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ShowRoomBoundingElements { get; }
```